# Pandas Exercise (5 points)

For this exercise, we will use the file `financial_report.csv` in the `data` folder, which provides information about financial institutions in the USA, and has information about their name, city, state, certificates, etc.

## 1. Read the data

Import the table `financial_report.csv` as a dataframe `df1`. Note again that it is located in the `data` folder.

In [1]:
# Your code here
import pandas as pd
df1 = pd.read_csv('data/financial_report.csv')

Display the summary information about the dataframe. How many rows and columns are in the dataframe?

In [2]:
# Your code here
df1.shape

(551, 7)

Display the first 10 rows of the table, using the head() function.

In [3]:
# Your code here
df1.head(10)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
5,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,13-Jan-17,18-May-17
6,Allied Bank,Mulberry,AR,91,Today's Bank,23-Sep-16,17-Nov-16
7,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,19-Aug-16,1-Jun-17
8,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,6-May-16,6-Sep-16
9,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,29-Apr-16,6-Sep-16

Display the last 20 rows of the table, using the tail() function.

In [4]:
# Your code here
df1.tail(20)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
531,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,12-Mar-04,5-Jun-12
532,Dollar Savings Bank,Newark,NJ,31330,No Acquirer,14-Feb-04,9-Apr-08
533,Pulaski Savings Bank,Philadelphia,PA,27203,Earthstar Bank,14-Nov-03,22-Jul-05
534,First National Bank of Blanchardville,Blanchardville,WI,11639,The Park Bank,9-May-03,5-Jun-12
535,Southern Pacific Bank,Torrance,CA,27094,Beal Bank,7-Feb-03,20-Oct-08
536,Farmers Bank of Cheneyville,Cheneyville,LA,16445,Sabine State Bank & Trust,17-Dec-02,20-Oct-04
537,Bank of Alamo,Alamo,TN,9961,No Acquirer,8-Nov-02,18-Mar-05
538,AmTrade International Bank,Atlanta,GA,33784,No Acquirer,30-Sep-02,11-Sep-06
539,Connecticut Bank of Commerce,Stamford,CT,19183,Hudson United Bank,26-Jun-02,14-Feb-12
540,New Century Bank,Shelby Township,MI,34979,No Acquirer,28-Mar-02,18-Mar-05
541,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,1-Mar-02,9-Apr-08
542,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,7-Feb-02,5-Feb-15
543,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,1-Feb-02,25-Oct-12
544,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,18-Jan-02,6-Nov-03
545,"Hamilton Bank, NA",Miami,FL,24382,Israel Discount Bank of New York,11-Jan-02,21-Sep-15
546,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,19-Aug-14
547,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,18-Nov-02
548,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,18-Feb-03
549,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,17-Mar-05
550,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,17-Mar-05

Display the column names (using the `.columns` attribute).

In [5]:
# Your code here
df1.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

## 2. Column Manipulation

Create a new column in the dataframe called `'City, ST'` by adding City and State information (e.g., Saint Elmo, IL). Display the head of the resulting dataframe.

In [6]:
# Your code here
df1['City, ST'] = df1['City'] + ', ' + df1['ST']
df1.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date,"City, ST"
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17,"Saint Elmo, IL"
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17,"Milwaukee, WI"
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17,"New Orleans, LA"
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17,"Cottonwood Heights, UT"
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17,"Chicago, IL"

Change the name of the column `CERT` to `Certificates`.

In [7]:
# Your code here
df1.rename(columns={'CERT' : 'Certificates'}, inplace=True)
df1.head(3)

,Bank Name,City,ST,Certificates,Acquiring Institution,Closing Date,Updated Date,"City, ST"
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17,"Saint Elmo, IL"
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17,"Milwaukee, WI"
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17,"New Orleans, LA"

Create a pandas series object called `series1` from the column `Acquiring Institution`. Confirm the type of `series1`.

In [8]:
# Your code here
series1 = pd.Series(data='Acquiring Institution')
type(series1)

pandas.core.series.Series

Delete the column `'Updated Date'` from the dataframe.

In [9]:
# Your code here
df1.drop(columns=['Updated Date'], inplace=True)
df1.head()

,Bank Name,City,ST,Certificates,Acquiring Institution,Closing Date,"City, ST"
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,"Saint Elmo, IL"
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,"Milwaukee, WI"
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,"New Orleans, LA"
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,"Cottonwood Heights, UT"
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,"Chicago, IL"

Reorder the columns so that the `City, ST` column is after the `ST` column.

In [10]:
# Your code here
#city, st before? the st?
col = df1.pop('City, ST')
df1.insert(3, col.name, col)
df1.head()

,Bank Name,City,ST,"City, ST",Certificates,Acquiring Institution,Closing Date
0,Fayette County Bank,Saint Elmo,IL,"Saint Elmo, IL",1802,"United Fidelity Bank, fsb",26-May-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,"Milwaukee, WI",30003,First-Citizens Bank & Trust Company,5-May-17
2,First NBC Bank,New Orleans,LA,"New Orleans, LA",58302,Whitney Bank,28-Apr-17
3,Proficio Bank,Cottonwood Heights,UT,"Cottonwood Heights, UT",35495,Cache Valley Bank,3-Mar-17
4,Seaway Bank and Trust Company,Chicago,IL,"Chicago, IL",19328,State Bank of Texas,27-Jan-17

## 3. Information Retrieval

How many different states have banks in this dataset?

In [11]:

df1.ST.nunique()

44

Display all the states in the `ST` column.

In [12]:
df1['ST']

0      IL
1      WI
2      LA
3      UT
4      IL
       ..
546    IL
547    OH
548    NH
549    IL
550    HI
Name: ST, Length: 551, dtype: object

Display the number of acquisitions for each acquiring institution.

In [13]:
# Your code here
df1['Acquiring Institution'].value_counts()

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
                                       ..
BankSouth                               1
McFarland State Bank                    1
Bank 7                                  1
Farmers & Merchants Savings Bank        1
Bank of the Orient                      1
Name: Acquiring Institution, Length: 286, dtype: int64

Display the top 4 acquiring institutions (ignore 'No Acquirer') and the number of acquisitions for each of them.

In [14]:
# Your code here
df1['Acquiring Institution'].value_counts()[1:5]

State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

Display the number of acquisitions for each acquiring institution in alphabetical order.

In [15]:
# Your code here
df1['Acquiring Institution'].value_counts(sort=False).sort_index()

1st United Bank                        3
Advantage National Bank Group          1
Alerus Financial, N.A.                 2
Allegheny Valley Bank of Pittsburgh    1
Alma Bank                              1
                                      ..
Whidbey Island Bank                    2
Whitney Bank                           1
Wilshire State Bank                    1
Xenith Bank                            1
Your Community Bank                    1
Name: Acquiring Institution, Length: 286, dtype: int64

Are there any missing values in the dataframe?

In [16]:
# Your code here
df1.isnull().any()

Bank Name                False
City                     False
ST                       False
City, ST                 False
Certificates             False
Acquiring Institution    False
Closing Date             False
dtype: bool

How many `Certificates` values are above 20,000?

In [17]:
# Your code here
df1['Certificates'].loc[df1['Certificates']>20000].count()

417

Create a new dataframe called `df2` from df1, by selecting only the banks with more than 20,000 certificates. Print the summary statistics for the dataframe `df2`.

In [18]:
# Your code here
df2 = df1[df1['Certificates'] > 20000]
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 417 entries, 1 to 550
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Bank Name              417 non-null    object
 1   City                   417 non-null    object
 2   ST                     417 non-null    object
 3   City, ST               417 non-null    object
 4   Certificates           417 non-null    int64
 5   Acquiring Institution  417 non-null    object
 6   Closing Date           417 non-null    object
dtypes: int64(1), object(6)
memory usage: 26.1+ KB

Display all the banks that Centennial Bank has acquired.

In [19]:
# Your code here
df1['Bank Name'][df1['Acquiring Institution']=='Centennial Bank']

64      Heritage Bank of Florida
214    Gulf State Community Bank
233                 Wakulla Bank
255       Coastal Community Bank
256         Bayside Savings Bank
322                Key West Bank
332            Old Southern Bank
Name: Bank Name, dtype: object

## 4. Groups

Create a new column called `'CA_bank'` which contains Boolean `True` or `False` values to indicate if the bank is in California or not.

In [20]:
# Your code here
df1['CA_bank'] = (df1['ST']=='CA')

Use `groupby` to find the number of banks in each city in California, based on the newly created column `'CA_bank'`. Sort the numbers in descending order (i.e., the city with the most banks is on top).

In [21]:
# Your code 
df1[df1['CA_bank']==True].groupby('Bank Name').sum()

                                          Certificates  CA_bank
Bank Name
1st Centennial Bank                              33025        1
1st Pacific Bank of California                   35517        1
Affinity Bank                                    27197        1
Alliance Bank                                    23124        1
Butte Community Bank                             33219        1
California National Bank                         34659        1
Canyon National Bank                             34692        1
Charter Oak Bank                                 57855        1
Citizens Bank of Northern California             33983        1
County Bank                                      22574        1
Downey Savings & Loan                            30968        1
First Bank of Beverly Hills                      32069        1
First Federal Bank of California, F.S.B.         28536        1
First Heritage Bank, NA                          57961        1
First Regional Bank                              23011        1
First Vietnamese American Bank                   57885        1
Frontier Bank, FSB D/B/A El Paseo Bank           34738        1
Granite Community Bank, NA                       57315        1
Imperial Capital Bank                            26348        1
IndyMac Bank                                     29730        1
Innovative Bank                                  23876        1
La Jolla Bank, FSB                               32423        1
Los Padres Bank                                  32165        1
MetroPacific Bank                                57893        1
Mirae Bank                                       57332        1
PFF Bank & Trust                                 28344        1
Pacific Coast National Bank                      57914        1
Pacific National Bank                            30006        1
Pacific State Bank                               27090        1
Palm Desert National Bank                        23632        1
San Diego National Bank                          23594        1
San Joaquin Bank                                 23266        1
San Luis Trust Bank, FSB                         34783        1
Security Pacific Bank                            23595        1
Sonoma Valley Bank                               27259        1
Southern Pacific Bank                            27094        1
Tamalpais Bank                                   33493        1
Temecula Valley Bank                             34341        1
United Commercial Bank                           32469        1
Vineyard Bank                                    23556        1
Western Commercial Bank                          58087        1

Use `groupby` to find which acquiring institution has the most acquisitions in California.

In [22]:
# Your code 
ddf = df1[df1['CA_bank']==True].groupby('Acquiring Institution').sum()
ddf['CA_bank'].sort_values()[-10:]

Acquiring Institution
Rabobank, N.A.                         2
City National Bank                     2
Westamerica Bank                       2
California Bank & Trust                2
First-Citizens Bank & Trust Company    2
Pacific Premier Bank                   2
OneWest Bank, FSB                      3
U.S. Bank N.A.                         3
First California Bank                  3
Pacific Western Bank                   3
Name: CA_bank, dtype: int64